app/Controllers/Emprestimo.php

    public function index(){
        $emprestimo = $this->EmprestimoModel->findAll();
        $livro = $this->livroModel->findAll();
        $dadosobra = $this->obraModel->findAll();
        $aluno = $this->alunoModel->findAll();
        $usuario = $this->usuarioModel->findAll();
---
SELECT *
FROM `emprestimo`
SELECT *
FROM `livro`
SELECT *
FROM `obra`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`

    public function cadastrar()
    {
        $dados = $this->request->getPost();
        $this->EmprestimoModel->save($dados);
        $this->livroModel->update($dados['id_livro'], ['disponivel' => 0]);
---
INSERT INTO `emprestimo` (`data_inicio`, `data_prazo`, `id_livro`, `id_aluno`, `id_usuario`) VALUES ('2024-06-01', '', '4', '2', '1')
UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('4')

    public function editar($id)
    {
        $dados = $this->EmprestimoModel->find($id);
        $dadosaluno = $this->alunoModel->findAll();
        $dadosobra = $this->obraModel->findAll();
        $dadosusuario = $this->usuarioModel->findAll();
        $dadoslivro = $this->livroModel->findAll();
---
SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '6'
SELECT *
FROM `aluno`
SELECT *
FROM `obra`
SELECT *
FROM `usuario`
SELECT *
FROM `livro`

    public function salvar(){
        $dados = $this->request->getPost();
        $this->EmprestimoModel->save($dados);
        $this->livroModel->update($dados['id_livro_antigo'], ['disponivel' => 1]);
        $this->livroModel->update($dados['id_livro'], ['disponivel' => 0]);
---
UPDATE `emprestimo` SET `data_inicio` = '2024-06-01', `data_fim` = '2024-06-22', `data_prazo` = '15', `id_livro` = '4', `id_aluno` = '1', `id_usuario` = '1'
WHERE `emprestimo`.`id` IN ('8')
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('6')
UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('4')

    public function salvardev(){
        $dados = $this->request->getPost();
        $this->EmprestimoModel->save($dados);
        $this->livroModel->update($dados['id_livro'], ['disponivel' => 1]);
---
UPDATE `emprestimo` SET `data_fim` = '2024-06-22', `data_prazo` = '15', `id_livro` = '6'
WHERE `emprestimo`.`id` IN ('8')
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('6')

    public function excluir(){
        $dados = $this->request->getPost();
        $this->EmprestimoModel->delete($dados);
---
DELETE FROM `emprestimo`
WHERE `id` IN ('6','5')

    public function devolucao($id){
        $emprestimo = $this->EmprestimoModel->find($id);
        $dadosobra = $this->obraModel->findAll();
        $livro = $this->livroModel->findAll();
        echo view('_partials/header');
        echo view('_partials/navbar');
        $this->livroModel->update($emprestimo['id_livro'], ['disponivel' => 1]);
---
SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '8'
SELECT *
FROM `obra`
SELECT *
FROM `livro`
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('4')